Repository: fewarren/Omeka-S-VideoThumbnails
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: WARNING:
fr: ATTENTION :

source: Derivative files
fr: Fichiers dérivés

source: This type is not supported.
fr: Ce type n’est pas géré.

source: This type is not available.
fr: Ce type n’est pas disponible.

source: Resource is not an item.
fr: La ressource n’est pas un contenu.

source: This derivative is ready. Reload the page.
fr: Ce fichier dérivé est prêt. Recharger la page.

source: This derivative is not ready. Ask the webmaster for it.
fr: Ce fichier dérivé n’est pas prêt. Demandez-le au webmestre.

source: This type of derivative file cannot be prepared for this item.
fr: Ce type de fichier dérivé ne peut pas être préparé pour ce contenu.

source: This derivative files of this item cannot be prepared.
fr: Ce fichier dérivé ne peut pas être créé pour ce contenu.

source: This derivative is being created. Come back later.
fr: Ce fichier dérivé est en cours de création. Revenez plus tard.

source: Your browser does not support HTML5 audio, but you can download it: %s.
fr: Votre navigateur ne supporte pas HTML5 audio, mais vous pouvez le télécharger : %s.

source: Your browser does not support HTML5 video, but you can download it: %s.
fr: Votre navigateur ne supporte pas HTML5 video, mais vous pouvez le télécharger : %s.

source: Are you sure to download this file?
fr: Êtes-vous sûr de télécharger ce fichier ?

source: Are you sure to download the file of {size}?
fr: Êtes-vous sûr de télécharger ce fichier de {size}?

source: The file is in queue. Reload the page later.
fr: Le fichier est dans la file. Rechargez la page plus tard.

source: ["Bytes", "KB", "MB", "GB", "TB", "PB", "EB", "ZB", "YB"]
fr: ["octets", "Ko", "Mo", "Go", "To", "Po", "Eo", "Zo", "Yo"]

source: A new option was added to enable specific converters.
fr: Une nouvelle option a été ajoutée pour activer les convertisseurs.

source: It is now possible to output a zip of all files of an item (format url: https://example.org/derivative/zip/{item_id}).
fr: Il est désormais possible de créer un fichier zip avec tous les fichiers d’un contenu (format url: https://example.org/derivative/zip/{item_id}).

source: Many new formats have been added: zip, text, alto, iiif, pdf.
fr: De nombreux formats ont été ajoutés : zip, text, alto, iiif, pdf.

source: A resource page block allows to display the list of available derivatives of a resource.
fr: Un bloc de page permet désormais d'afficher la liste des fichiers dérivés disponibles pour une ressource.

source: Check {link_url}new settings{link_end}.
fr: Vérifier {link_url}les nouveaux paramètres{link_end}.

source: The module manages now http requests "Content Range" that allow to read files faster.
fr: Le module gère désormais les requêtes http de type « Content Range » qui permet de lire les fichiers plus rapidement.

source: Helpers "derivativeMedia" and "hasDerivative" were renamed "derivatives" and "derivativeList".
fr: Les view helpers « derivativeMedia » et « hasDerivative » ont été renommés en « derivatives » et « derivativeList ».

source: The module manages now pdf files. Check {link_url}new settings{link_end}.
fr: Le module gère désormais les fichiers pdf. Vous pouvez {link_url}vérifier les nouveaux paramètres{link_end}.

source: It is now possible to run the job to create derivative and metadata by items. See {link_url}config form{link_end}.
fr: Il est désormais possible de lancer une tâche pour créer des fichiers dérivés et des métadonnées par contenu. Voir la {link_url}configuration{link_end}.

source: Settings were updated. You may check {link_url}them{link_end}.
fr: Les paramètres ont été mis à jour. Vous pouvez {link_url}les vérifier{link_end}.

source: The directory "{path}" is not writeable.
fr: Le dossier "{path}" n’est pas inscriptible.

source: The extension "php-zip" should be installed on the server to create Zip files.
fr: L’extension « php-zip » doit être installée sur le serveur pour créer des fichiers zip.

source: Before compressing files with config tasks, the settings should be set in {link_url}main settings{link_end}.
fr: Avant de convertir les fichiers, les options peuvent être définies dans {link_url}les paramètres généraux{link_end}.

source: All derivative files will be kept in the folders specified in the config inside {path}.
fr: Tous les fichiers dérivés sont conservés dans des dossiers spécifiés dans la config à l’intérieur de {path}.

source: This page allows to launch background job to prepare static derivative files according to parameters set in %1$smain settings%2$s.
fr: Cette page permet de lancer des tâches en arrière-plan pour préparer les fichiers dérivés statiques en fonction des %1$sparamètres généraux%2$s.

source: No job launched.
fr: Aucune tâche lancée.

source: The command "ffmpeg" should be available on the server to convert audio or video.
fr: La ocmmande « ffmpeg » doit être installée sur le serveur pour convertir des fichiers audio ou vidéo.

source: The command "gs" (ghostscript) should be available on the server to convert pdf.
fr: La commande « gs » (ghostscript) doit être installée sur le serveur pour convertir des pdf.

source: Creating derivative media by items ({link_url}job #{job_id}{link_end}, {link_log}logs{link_end})
fr: Création des médias dérivés ({link_url}tâche #{job_id}{link_end}, {link_log}journaux{link_end})

source: Creating derivative media ({link_url}job #{job_id}{link_end}, {link_log}logs{link_end})
fr: Création des médias dérivés ({link_url}tâche #{job_id}{link_end}, {link_log}journaux{link_end})

source: Storing metadata for existing files ({link}job #{job_id}{link_end}, {link_log}logs{link_end})
fr: Enregistrement des métadonnées pour les fichiers présents ({link}tâche #{job_id}{link_end}, {link_log}journaux{link_end})

source: [Derivative Media] This module requires a local store currently.
fr: [Media dérivés] Ce module nécessite un espace de stockage local actuellement.

source: The command-line utility "ffmpeg" should be installed and should be available in the cli path to make audio and video derivatives.
fr: L’utilitaire en ligne de commande « ffmpeg » doit être installé et disponible dans le chemin de la ligne de commande pour convertir des audios et des vidéos.

source: The command-line utility "gs" (ghoscript) should be installed and should be available in the cli path to make pdf derivatives.
fr: L’utilitaire en ligne de commande « gs » (ghostscript) doit être installé et disponible dans le chemin de la ligne de commande pour convertir des pdf.

source: Zip of all files
fr: Zip de tous les fichiers

source: Zip of media files
fr: Zip des fichiers média

source: Zip of other files
fr: Zip des autres fichiers

source: Extracted text
fr: Texte extrait

source: Iiif manifest v2
fr: Iiif manifeste v2

source: Iiif manifest v3
fr: Iiif manifeste v3

source: Text from pdf as xml
fr: Texte du pdf en xml

source: Unable to create directory.
fr: Impossible de créer le dossier.

source: Unable to remove existing file.
fr: Impossible de supprimer le fichier.

source: The derivative is currently beeing created.
fr: Le fichier dérivé est en cours de création.

source: To create xml alto, the module IiifSearch is required for now.
fr: Pour créer le xml alto, le module IiifSearch est nécessaire.

source: To create iiif manifest, the module IiifServer is required for now.
fr: Pour créer un manifest Iiif, le module IiifServer est nécessaire.

source: Extraction can be done on a single pdf attached to an item.
fr: L’extraction peut être réalisée sur le fichier pdf unique d’un contenu.

source: The php extension "php-zip" must be installed.
fr: L’extension « php-zip » doit être installée.

source: Unable to create the zip file.
fr: Impossible de créer le fichier zip.

source: No item #{item_id}: no derivative media to create.
fr: Pas de contenu #{item_id} : aucun fichier dérivé à créer.

source: No media #{media_id}: no derivative media to create.
fr: Média #{media_id} : aucun fichier dérivé à créer.

source: Media #{media_id}: not an audio or video file.
fr: Média #{media_id} : pas un fichier audio ou vidéo.

source: The command-line utility "ffmpeg" and/or "gs" (ghostscript) should be installed and should be available in the cli path to make derivatives.
fr: L’utilitaire en ligne de commande « ffmpeg » et/ou « gs » (ghostscript) doit être installé et disponible dans le chemin de la ligne de commande.

source: The derivative command "{command}" for {type} contains forbidden characters [$<>;&|%"\..].
fr: La commande "{command}" pour {type} contient des caractères interdits [$<>;&|%"\..].

source: The derivative pattern "{pattern}" for {type} does not create a real path.
fr: Le modèle de chemin dérivé "{pattern}" pour {type} ne permet pas de créer un chemin réel.

source: A local store is required to derivate media currently.
fr: Un espace de stockage local est nécessaire pour dériver les médias actuellement.

source: The command-line utility "ffmpeg" should be installed and should be available in the cli path to make derivatives.
fr: L’utilitaire en ligne de commande « ffmpeg » doit être installé et disponible dans le chemin de la ligne de commande.

source: The command-line utility "gs" (ghostscript) should be installed and should be available in the cli path to make derivatives.
fr: L’utilitaire en ligne de commande « gs » (ghostscript) doit être installé et disponible dans le chemin de la ligne de commande pour faire des fichiers dérivés.

source: Media #{media_id}: the original file does not exist ({filename})
fr: Média #{media_id} : le fichier original n’existe pas ({filename}).

source: Media #{media_id}: the original file is not readable ({filename}).
fr: Média #{media_id} : le fichier original ne peut pas être lu ({filename}).

source: Media #{media_id}: Process stopped.
fr: Média #{media_id} : traitement arrêté.

source: Media #{media_id}: the output cannot be the original folder.
fr: Média #{media_id} : le dossier d’écriture ne peut pas être le dossier original.

source: Media #{media_id}: the derivative pattern "{pattern}" does not create a real path.
fr: Média #{media_id} : le modèle de chemin "{pattern}" ne correspond pas à un vrai chemin.

source: Media #{media_id}: derivative media is not writeable ({filename}).
fr: Média #{media_id} : le fichier dérivé ne peut pas être écrit ({filename}).

source: Media #{media_id}: existing derivative media removed ({filename}).
fr: Média #{media_id} : le fichier dérivé existant a été supprimé ({filename}).

source: Media #{media_id}: creating derivative media "{filename}".
fr: Média #{media_id} : création du fichier dérivé "{filename}".

source: Media #{media_id}: derivative media cannot be created ({filename}).
fr: Média #{media_id} : le fichier dérivé ne peut pas être créé ({filename}).

source: Media #{media_id}: Output results for "{filename}": {output}
fr: Média #{media_id} : Sortie de la commande pour "{filename}": {output}

source: Media #{media_id}: derivative media is empty ({filename}).
fr: Média #{media_id} : le fichier dérivé est vide ({filename}).

source: Media #{media_id}: derivative media is not audio, video, or pdf, but "{mediatype}" ({filename}).
fr: Média #{media_id} : le fichier dérivé n’est pas un fichier audio, vidéo, ou pdf, mais « {mediatype} » ({filename}).

source: Media #{media_id}: derivative media cannot be stored ({filename}).
fr: Média #{media_id} : le fichier dérivé ne peut pas être enregistré ({filename}).

source: Media #{media_id}: derivative media created ({filename}).
fr: Média #{media_id} : le fichier dérivé a été créé ({filename}).

source: Media #{media_id}: the derivative file is not readable ({filename}).
fr: Média #{media_id} : le fichier dérivé ne peut pas être lu ({filename}).

source: Media #{media_id}: the derivative file is empty ({filename}).
fr: Média #{media_id} : le fichier dérivé est vide ({filename}).

source: Media #{media_id}: derivative media file metadata stored ({filename}).
fr: Média #{media_id} : les métadonnées du fichier dérivé ont été enregistrées ({filename}).

source: No enabled type of derivative to process.
fr: Aucun type de dérivé n’est activé.

source: No items selected.
fr: Aucun contenu choisi.

source: The job was stopped.
fr: La tâche a été arrêtée.

source: Item #{item_id}: derivative files for types {types} created successfully.
fr: Contenu #{item_id} : les fichiers dérivés de types {types} ont bien été créés.

source: The query or the list of item sets output no items.
fr: La requête ou la liste des collections ne renvoie aucun contenu.

source: No media to process for creation of derivative medias (on a total of {total} medias). You may check your query.
fr: Aucun média à traiter pour la création des médias dérivés (sur un total de {total} médias). Vous pouvez vérifier votre requête.

source: Processing creation of derivative medias of {total_process} medias (on a total of {total} medias).
fr: Traitement lancé pour la création des fichiers dérivés de {total_process} médias (sur un total de {total} médias).

source: The job "Derivative Media" was stopped: {count}/{total} resources processed.
fr: La tâche "Médias dérivés" a été arrêtée : {count}/{total} ressources traitées.

source: Media #{media_id} ({count}/{total}): creating derivative files.
fr: Média #{media_id} ({count}/{total}) : création des fichiers dérivés.

source: Media #{media_id} ({count}/{total}): The media is not an audio, a video or a pdf file.
fr: Média #{media_id} ({count}/{total}) : le média n’est pas un fichier audio, vidéo ou un pdf.

source: End of the creation of derivative files: {count}/{total} processed, {skipped} skipped, {succeed} succeed, {failed} failed.
fr: Fin de la création des fichiers dérivés : {count}/{total} traités, {skipped} ignorés, {succeed} avec succès, {failed} échecs.

source: No media to process for storing metadata of derivative medias (on a total of {total} medias). You may check your query.
fr: Aucun média à traiter pour l’enregistrement des métadonnées des médias dérivés (sur un total de {total} médias). Vous pouvez vérifier votre requête.

source: Processing storing metadata of derivative medias of {total_process} medias (on a total of {total} medias).
fr: Traitement lancé pour l’enregistrement des métadonnées des fichiers dérivés de {total_process} médias (sur un total de {total} médias).

source: The job "Storing metadata" was stopped: {count}/{total} resources processed.
fr: La tâche "Enregistrement des métadonnées" a été arrêtée : {count}/{total} ressources traitées.

source: Media #{media_id} ({count}/{total}): storing metadata of derivative files.
fr: Média #{media_id} ({count}/{total}) : enregistrement des métadonnées des fichiers dérivés.

source: Media #{media_id} ({count}/{total}): The media is not an audio or video file.
fr: Média #{media_id} ({count}/{total}) : le média n’est pas un fichier audio ou vidéo.

source: End of the process to store metadata of derivative files: {count}/{total} processed, {skipped} skipped, {succeed} succeed, {failed} failed.
fr: Fin de l’enregistrement des métadonnées des fichiers dérivés : {count}/{total} traités, {skipped} ignorés, {succeed} avec succès, {failed} échecs.

source: Derivative Media
fr: Médias dérivés

source: Formats to convert
fr: Formats à convertir

source: Video
fr: Vidéo

source: Zip item files
fr: Zip des fichiers

source: Zip item image/audio/video files
fr: Zip des images, audio et vidéo

source: Zip item other files
fr: Zip des autres fichiers

source: Pdf from images files
fr: Pdf à partir des fichiers images

source: Single text file from by-page txt files
fr: Fichier texte unique à partir fichiers texte par page

source: Single text file from property "extracted text"
fr: Fichier texte unique à partir de la propriété « texte extrait »

source: Single xml Alto from by-page xml Alto (standard ocr format, require Iiif Search)
fr: Fichier xml Alto unique à partir de multiple fichier xml Alto par page (format ocr standard, nécessite Iiif Search)

source: Iiif manifest (version 2, require Iiif Server)
fr: Iiif manifeste (version 2, requiert Iiif Server)

source: Iiif manifest (version 3, require Iiif Server)
fr: Iiif manifeste (version 3, requiert Iiif Server)

source: Text as xml from a single pdf, mainly for Iiif Search
fr: Texte en xml à partir d’un fichier pdf unique, principalement pour Iiif Search

source: Create or update derivative files on individual save (not batch process)
fr: Créer et mettre à jour tous les fichiers dérivés lors d’un enregistrement (hors traitement en lot)

source: Quick processes can be done during a web request (30 seconds); heavy processes are audio, video, pdf and zip with many big files and require a background job. Audio and video processes are never reprocessed, since the original cannot change.
fr: Les traitements rapides peuvent être réalisés pendant une requête web (30 seconds) ; les traitements lourds sont les audio, vidéo, pdf et zip avec de nombreux fichiers, qui nécessitent une tâche en arrière-plan. Les audios et vidéos ne sont jamais retraités, car les originaux ne peuvent pas changer.

source: No (may need manual process)
fr: Non (peut nécessiter un traitement manuel)

source: Update only existing derivative files (quick processes only)
fr: Mettre à jour seulement les fichiers dérivés existants (traitement rapide uniquement)

source: Update only existing derivative files
fr: Mettre à jour seulement les fichiers dérivés existants

source: Create and update all quick derivatives
fr: Créer et mettre à jour tous les fichiers dérivés rapides

source: Create and update all derivatives (take care of disk space and server overload)
fr: Créer et mettre à jour tous les fichiers dérivés (attention à l’espace disque et à la charge serveur)

source: Max total media size in megabytes to prepare a derivative file live
fr: Taille maximale d’un fichier en méga-octets pour créer les fichiers dérivés en temps réel

source: Audio converters
fr: Convertisseurs audio

source: Each converter is one row with a filepath pattern, a "=", and the ffmpeg command (without file).
fr: Chaque convertisseur correspond à une ligne avec un modèle de chemin, un "=", et la commande ffmpeg (sans le fichier).

source: Append original audio
fr: Ajouter l’audio originale

source: Video converters
fr: Convertisseurs vidéo

source: Append original video
fr: Ajouter la vidéo originale

source: Pdf converters
fr: Convertisseurs pdf

source: Each converter is one row with a filepath pattern, a "=", and the gs command (ghostscript, without file).
fr: Chaque convertisseur correspond à une ligne avec un modèle de chemin, un "=", et la commande gs (ghostscript, sans le fichier).

source: Create derivatives by items
fr: Créer les dérivés par contenu

source: Query items
fr: Requête pour les contenus

source: Create derivative files by items in background
fr: Créer les fichiers dérivés par contenu en arrière-plan

source: Process
fr: Traitement

source: Create derivatives by media
fr: Créer les dérivés par média

source: Select item sets…
fr: Choisir des collections…

source: Ingesters
fr: Ingéreurs

source: Renderers
fr: Rendus

source: Media types
fr: Types de média

source: Media ids
fr: Ids médias

source: Create derivative files in background
fr: Créer les fichiers dérivés en arrière-plan

source: Store metadata for existing files in directories
fr: Enregistrer les métadonnées des fichiers présents dans les dossiers

source: When files are created outside of Omeka and copied in the right directories (webm/, mp3/, etc.) with the right names (same as original and extension), Omeka should record some metadata to be able to render them.
fr: Quand les fichiers sont créés en dehors d’Omeka et copié dans les dossiers correspondants (webm/, mp3/, etc.) avec les noms corrects (le même que l’original avec une extension), Omeka doit enregistrer quelques métadonnées pour être en mesure de les rendre.

source: Update metadata
fr: Mettre à jour les métadonnées

source: Derivative Media List
fr: Liste des médias dérivés
